{
    "newsArticles": [
      {
        "id": 1,
        "title": "Pemprov DKI Jakarta Resmi Luncurkan Program Transportasi Terintegrasi",
        "summary": "Program ini akan menghubungkan berbagai moda transportasi seperti MRT, LRT, TransJakarta, dan angkutan umum lainnya.",
        "content": "<p>Pemerintah Provinsi DKI Jakarta hari ini meluncurkan program transportasi terintegrasi yang bertujuan untuk meningkatkan konektivitas antar moda seperti MRT, LRT, TransJakarta, dan angkutan umum lainnya.</p><p>Program ini juga akan dilengkapi dengan sistem tiket terintegrasi dan aplikasi pemantau jadwal transportasi secara real-time.</p>",
        "imageUrl": "assets/images/berita1.jpg",
        "publishedAt": "2025-04-30T10:00:00Z",
        "source": "Berita Jakarta",
        "slug": "transportasi-terintegrasi"
      },
      {
        "id": 2,
        "title": "Cuaca Ekstrem Landa Jabodetabek, Warga Diminta Waspada",
        "summary": "BMKG mengimbau masyarakat untuk menghindari aktivitas luar ruang pada jam-jam tertentu.",
        "content": "<p>Badan Meteorologi, Klimatologi, dan Geofisika (BMKG) mengumumkan bahwa Jabodetabek akan mengalami hujan intensitas tinggi disertai angin kencang dan petir hingga akhir pekan ini.</p><p>Warga diminta waspada terhadap potensi banjir dan pohon tumbang.</p>",
        "imageUrl": "assets/images/berita2.jpg",
        "publishedAt": "2025-04-29T18:30:00Z",
        "source": "Kompas",
        "slug": "cuaca-ekstrem-jabodetabek"
      },
      {
        "id": 3,
        "title": "Festival Kuliner Betawi Digelar di Monas Pekan Ini",
        "summary": "Lebih dari 100 UMKM kuliner hadir menawarkan hidangan khas Betawi kepada pengunjung.",
        "content": "<p>Festival Kuliner Betawi akan digelar selama tiga hari di area Monas. Acara ini menampilkan berbagai makanan khas Betawi seperti kerak telor, soto Betawi, dan bir pletok.</p><p>Pengunjung juga bisa menikmati pertunjukan seni dan budaya sepanjang acara.</p>",
        "imageUrl": "assets/images/berita3.jpg",
        "publishedAt": "2025-04-28T14:15:00Z",
        "source": "Detik",
        "slug": "festival-kuliner-betawi"
      }
    ]
  }
  